package by.academy.tasks.циклы;

// 20. Даны два двузначных числа А и В. Из этих чисел составили 2 четырехзначных числа:
// первое число получили путем написания сначала числа А, затем В.
// Для получения второго числа сначала записали число В, затем А.
// Найти числа А и В если известно, что первое четырехзначное число нацело делится на 99, а второе на 49.

public class Ex20 {
    public static void main(String[] args) {
        System.out.println("Я устал, я ухожу");
    }
}
